
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭксклюзивAPI_ВыгрузкаВПФ.ПроверитьСоздатьПользователяПФ();
	
	РезультатВыгрузки = ЭксклюзивAPI_ВыгрузкаВПФ.ВыгрузитьОбъект(ПараметрКоманды);
	
	Оповестить("ОбновитьСостояниеЭД");
	
	Если РезультатВыгрузки.errorCode = 0 Тогда		
		ПоказатьПредупреждение(,"Документ успешно выгружен");		
	Иначе
		ПоказатьПредупреждение(,"Ошибка " + РезультатВыгрузки.errorCode +  ": " + РезультатВыгрузки.errorDescription);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Строка) Тогда
		ЭксклюзивAPI_ВыгрузкаВПФ.СохранитьЛогинПарольПользователя(Строка);
	КонецЕсли;
	
КонецПроцедуры

