&НаСервере
Функция ПолучитьПланПоПоказателюПоМенеджеру(Месяц,Менеджер,Показатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Экс_ДанныеKPIМенеджеровГрузовогоОтдела.План
	|ИЗ
	|	РегистрСведений.Экс_ДанныеKPIМенеджеровГрузовогоОтдела КАК Экс_ДанныеKPIМенеджеровГрузовогоОтдела
	|ГДЕ
	|	Экс_ДанныеKPIМенеджеровГрузовогоОтдела.Месяц = &Месяц
	|	И Экс_ДанныеKPIМенеджеровГрузовогоОтдела.Менеджер = &Менеджер
	|	И Экс_ДанныеKPIМенеджеровГрузовогоОтдела.Показатель = &Показатель";
	
	Запрос.УстановитьПараметр("Месяц",Месяц);
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	Запрос.УстановитьПараметр("Показатель",Показатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.План;
	Иначе
		Возврат 0;
	КонецЕсли;		
	
КонецФункции

&НаСервере
Функция ПолучитьФактПоПоказателюПоМенеджеру(Месяц,Менеджер,Показатель,тзВыручка = Неопределено,тзКолеса = Неопределено,тзОборотСФильтрами = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Экс_ДанныеKPIМенеджеровГрузовогоОтдела.Факт
	|ИЗ
	|	РегистрСведений.Экс_ДанныеKPIМенеджеровГрузовогоОтдела КАК Экс_ДанныеKPIМенеджеровГрузовогоОтдела
	|ГДЕ
	|	Экс_ДанныеKPIМенеджеровГрузовогоОтдела.Месяц = &Месяц
	|	И Экс_ДанныеKPIМенеджеровГрузовогоОтдела.Менеджер = &Менеджер
	|	И Экс_ДанныеKPIМенеджеровГрузовогоОтдела.Показатель = &Показатель";
	
	Запрос.УстановитьПараметр("Месяц",Месяц);
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	Запрос.УстановитьПараметр("Показатель",Показатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() И Выборка.Факт > 0 Тогда
	
		Возврат Выборка.Факт;
		
	ИначеЕсли Показатель.ФактЗадаётсяВручную Тогда
		
		Возврат 0;
		
	Иначе
		
		Если Показатель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.СборБУАвтошин Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПоступлениеТоваровУслугДополнительныеРеквизиты.Ссылка КАК Поступление,
			|	ПоступлениеТоваровУслугДополнительныеРеквизиты.Значение КАК МенеджерГрузовогоОтдела
			|ПОМЕСТИТЬ втМенеджерыГрузовогоОтделаПартнеров
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг.ДополнительныеРеквизиты КАК ПоступлениеТоваровУслугДополнительныеРеквизиты
			|ГДЕ
			|	ПоступлениеТоваровУслугДополнительныеРеквизиты.Свойство = &СвойствоМенеджерГрузовогоОтдела
			|	И ПоступлениеТоваровУслугДополнительныеРеквизиты.Значение = &Менеджер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ЗакупкиОбороты.КоличествоОборот) КАК Количество
			|ИЗ
			|	РегистрНакопления.Закупки.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, ) КАК ЗакупкиОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМенеджерыГрузовогоОтделаПартнеров КАК втМенеджерыГрузовогоОтделаПартнеров
			|		ПО (втМенеджерыГрузовогоОтделаПартнеров.Поступление = ЗакупкиОбороты.Регистратор)
			|ГДЕ
			|	ЗакупкиОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ(&Номенклатура)";
			
			Запрос.УстановитьПараметр("НачалоПериода",Месяц);
			Запрос.УстановитьПараметр("ОкончаниеПериода",КонецМесяца(Месяц));
			Запрос.УстановитьПараметр("СвойствоМенеджерГрузовогоОтдела",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Менеджер Грузового отдела продаж"));
			
			Запрос.УстановитьПараметр("Номенклатура",Справочники.Номенклатура.НайтиПоКоду("00016704"));
			Запрос.УстановитьПараметр("Менеджер",Менеджер);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Количество;
			КонецЕсли;
			
		ИначеЕсли Показатель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ПланПоОборотуЭкомодуль Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер,
			|	ПартнерыДополнительныеРеквизиты.Значение КАК МенеджерГрузовогоОтдела
			|ПОМЕСТИТЬ втМенеджерыГрузовогоОтделаПартнеров
			|ИЗ
			|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|ГДЕ
			|	ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоМенеджерГрузовогоОтдела
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка КАК Договор,
			|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
			|ПОМЕСТИТЬ втДоговорГрузовойОтдел
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
			|ГДЕ
			|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СоглашенияСКлиентамиДополнительныеРеквизиты.Ссылка КАК Соглашение,
			|	СоглашенияСКлиентамиДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
			|ПОМЕСТИТЬ втСоглашениеГрузовойОтдел
			|ИЗ
			|	Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияСКлиентамиДополнительныеРеквизиты
			|ГДЕ
			|	СоглашенияСКлиентамиДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела КАК МенеджерГрузовогоОтдела,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоОборот,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручкиОборот
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Регистратор,
			|			АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭкомодуль)
			|				И НЕ АналитикаУчетаПоПартнерам.Партнер В
			|						(ВЫБРАТЬ
			|							ПартнерыСегмента.Партнер
			|						ИЗ
			|							РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
			|						ГДЕ
			|							ПартнерыСегмента.Сегмент = &СегментТендер)) КАК ВыручкаИСебестоимостьПродажОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМенеджерыГрузовогоОтделаПартнеров КАК втМенеджерыГрузовогоОтделаПартнеров
			|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = втМенеджерыГрузовогоОтделаПартнеров.Партнер
			|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговорГрузовойОтдел КАК ДоговорГрузовойОтдел
			|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор = ДоговорГрузовойОтдел.Договор
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоглашениеГрузовойОтдел КАК СоглашениеГрузовойОтдел
			|		ПО ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Соглашение = СоглашениеГрузовойОтдел.Соглашение
			|ГДЕ
			|	(ДоговорГрузовойОтдел.ГрузовойОтдел = ИСТИНА
			|			ИЛИ СоглашениеГрузовойОтдел.ГрузовойОтдел = ИСТИНА)
			|	И втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела = &Менеджер
			|
			|СГРУППИРОВАТЬ ПО
			|	втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела";
			
			Запрос.УстановитьПараметр("НачалоПериода",Месяц);
			Запрос.УстановитьПараметр("ОкончаниеПериода",КонецМесяца(Месяц));
			Запрос.УстановитьПараметр("СвойствоМенеджерГрузовогоОтдела",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Менеджер Грузового отдела продаж"));
						
			массивОрганизацииЭкомодуль = Новый Массив;
			массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль",Истина));
			массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль-СПб",Истина));
			Запрос.УстановитьПараметр("ОрганизацииЭкомодуль",массивОрганизацииЭкомодуль);
			
			Запрос.УстановитьПараметр("ГрузовойОтдел",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Грузовой отдел",Истина));
			
			Запрос.УстановитьПараметр("СегментТендер",Справочники.СегментыПартнеров.НайтиПоНаименованию("ТЕНДЕР",Истина));
						
			Запрос.УстановитьПараметр("Менеджер",Менеджер);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.СуммаВыручкиОборот;
			КонецЕсли;
			
		ИначеЕсли Показатель.Родитель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ПланПоПродажеГруппы Тогда
			
			строкиПараметрГруппаТоваров = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Группа товаров"));
						
			ГруппаТоваров = строкиПараметрГруппаТоваров[0].Значение.Получить();
			
			строкиДанныеПоГруппе = тзКолеса.НайтиСтроки(Новый Структура("Менеджер,Бренд",Менеджер,ГруппаТоваров));
			
			Результат = 0;
			
			Для Каждого стрДанныеПоГруппе Из строкиДанныеПоГруппе Цикл
				
				Результат = Результат + стрДанныеПоГруппе.КоличествоОборот;	
				
			КонецЦикла;
			
			Возврат Результат;
			
		ИначеЕсли Показатель.Родитель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ПланПоПродажеГруппыПоКлиенту Тогда
			
			строкиПараметрГруппаТоваров = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Группа товаров"));
						
			ГруппаТоваров = строкиПараметрГруппаТоваров[0].Значение.Получить();
			
			строкиПараметрКлиент = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Клиент"));
						
			Клиент = строкиПараметрКлиент[0].Значение.Получить();
			
			строкиДанныеПоГруппе = тзКолеса.НайтиСтроки(Новый Структура("Менеджер,Клиент,Бренд",Менеджер,Клиент,ГруппаТоваров));
			
			Результат = 0;
			
			Для Каждого стрДанныеПоГруппе Из строкиДанныеПоГруппе Цикл
				
				Результат = Результат + стрДанныеПоГруппе.КоличествоОборот;	
				
			КонецЦикла;
			
			Возврат Результат;    			
			
			
		ИначеЕсли Показатель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ДолгиКОбороту Тогда
			
			строкиДанныеПоВыручке = тзВыручка.НайтиСтроки(Новый Структура("Менеджер,Клиент",Менеджер,"СВОИ"));
			
			Если строкиДанныеПоВыручке.Количество() > 0 Тогда
				
				ДанныеВыручки = строкиДанныеПоВыручке[0];
				                 
				Если ДанныеВыручки.СуммаВыручкиОборот <= 0 Тогда
					Возврат 1000;
				Иначе
					Возврат  100 * ДанныеВыручки.СуммаКонечныйОстаток / ДанныеВыручки.СуммаВыручкиОборот;
				КонецЕсли;
				
			КонецЕсли;
				
		//Самойлов А.С. Начало 2018-01-25 #373.2
		ИначеЕсли Показатель.Родитель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ДолгиКОбороту Тогда
			
			строкиПараметрИсключитьКлиента = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Исключить клиента"));
			ИсключитьКлиента = строкиПараметрИсключитьКлиента[0].Значение.Получить();			
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ГруппыПользователейСостав.Пользователь КАК СотрудникГрузовогоОтдела
			|ПОМЕСТИТЬ втСотрудникиГрузовогоОтдела
			|ИЗ
			|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
			|ГДЕ
			|	ГруппыПользователейСостав.Ссылка В(&ГруппыПользователейГрузовойОтдел)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот),0) КАК СуммаВыручкиОборот
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Регистратор,
			|			АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭксклюзив)
			|				ИЛИ АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭкомодуль)
			|					И АналитикаУчетаПоПартнерам.Партнер В
			|						(ВЫБРАТЬ
			|							ПартнерыСегмента.Партнер
			|						ИЗ
			|							РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
			|						ГДЕ
			|							ПартнерыСегмента.Сегмент = &СегментТендер)) КАК ВыручкаИСебестоимостьПродажОбороты
			|ГДЕ
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = &ИсключитьКлиента";
			
			Запрос.УстановитьПараметр("НачалоПериода",Месяц);
			Запрос.УстановитьПараметр("ОкончаниеПериода",КонецМесяца(Месяц));
			
			массивОрганизацииЭксклюзив = Новый Массив;
			массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив",Истина));
			массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив СПб",Истина));
			//Самойлов А.С. Начало 2018-07-04 #
			массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Тышкевич Наталья Николаевна ИП",Истина));
			//Самойлов А.С. Конец  2018-07-04	
			//Самойлов А.С. Начало 2018-11-14 #
			массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Сперанский Александр Николаевич ИП",Истина));
			//Самойлов А.С. Конец  2018-11-14
			Запрос.УстановитьПараметр("ОрганизацииЭксклюзив",массивОрганизацииЭксклюзив);
			
			массивОрганизацииЭкомодуль = Новый Массив;
			массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль",Истина));
			массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль-СПб",Истина));
			Запрос.УстановитьПараметр("ОрганизацииЭкомодуль",массивОрганизацииЭкомодуль);
						
			Запрос.УстановитьПараметр("СегментТендер",Справочники.СегментыПартнеров.НайтиПоНаименованию("ТЕНДЕР",Истина));
			
			Запрос.УстановитьПараметр("ИсключитьКлиента",ИсключитьКлиента);
			
			//Самойлов А.С. Начало 2018-07-04 #
			Запрос.УстановитьПараметр("Грузовые",Справочники.Номенклатура.НайтиПоНаименованию("ГРУЗОВЫЕ",Истина,Справочники.Номенклатура.ПустаяСсылка()));
			Запрос.УстановитьПараметр("Легкогрузовые",Справочники.Номенклатура.НайтиПоНаименованию("АВТОШИНА ЛЕГКОГРУЗОВАЯ С",Истина,Справочники.Номенклатура.ПустаяСсылка()));
				
			
			тзНастройки = ХранилищеОбщихНастроек.Загрузить("НастройкиЭксклюзив","ГруппыПользователейМотивацииГрузовогоОтдела",,"НастройкиЭксклюзив");
				
			Если ТипЗнч(тзНастройки) = Тип("ТаблицаЗначений") И тзНастройки.Количество() > 0 Тогда		
				СписокГрупп = тзНастройки.ВыгрузитьКолонку("ГруппаПользователей");		
			Иначе
				ВызватьИсключение "Нет настроек";
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ГруппыПользователейГрузовойОтдел",СписокГрупп);
			//Самойлов А.С. Конец  2018-07-04
			
			ВыборкаИсключить = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаИсключить.Следующий() Тогда
				МинусВОборот = ВыборкаИсключить.СуммаВыручкиОборот;
			Иначе
				МинусВОборот = 0;
			КонецЕсли;
					
			строкиДанныеПоВыручке = тзВыручка.НайтиСтроки(Новый Структура("Менеджер,Клиент",Менеджер,"СВОИ"));
			
			Если строкиДанныеПоВыручке.Количество() > 0 Тогда
				
				ДанныеВыручки = строкиДанныеПоВыручке[0];
				                 
				Если (ДанныеВыручки.СуммаВыручкиОборот - МинусВОборот) <= 0 Тогда
					Возврат 1000;
				Иначе
					Возврат  100 * ДанныеВыручки.СуммаКонечныйОстаток / (ДанныеВыручки.СуммаВыручкиОборот - МинусВОборот);
				КонецЕсли;
				
			КонецЕсли;	
		//Самойлов А.С. Конец  2018-01-25			
		ИначеЕсли Показатель.Родитель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ПродажаТоваровИзСписка Тогда
			
			строкиПараметрТовары = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Товары"));
						
			Товары = строкиПараметрТовары[0].Значение.Получить();			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер,
			|	ПартнерыДополнительныеРеквизиты.Значение КАК МенеджерГрузовогоОтдела
			|ПОМЕСТИТЬ втМенеджерыГрузовогоОтделаПартнеров
			|ИЗ
			|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|ГДЕ
			|	ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоМенеджерГрузовогоОтдела
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка КАК Договор,
			|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
			|ПОМЕСТИТЬ втДоговорГрузовойОтдел
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
			|ГДЕ
			|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СоглашенияСКлиентамиДополнительныеРеквизиты.Ссылка КАК Соглашение,
			|	СоглашенияСКлиентамиДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
			|ПОМЕСТИТЬ втСоглашениеГрузовойОтдел
			|ИЗ
			|	Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияСКлиентамиДополнительныеРеквизиты
			|ГДЕ
			|	СоглашенияСКлиентамиДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела КАК МенеджерГрузовогоОтдела,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоОборот,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручкиОборот
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Регистратор,
			|			АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭксклюзив)
			|				ИЛИ АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭкомодуль)
			|					И АналитикаУчетаПоПартнерам.Партнер В
			|						(ВЫБРАТЬ
			|							ПартнерыСегмента.Партнер
			|						ИЗ
			|							РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
			|						ГДЕ
			|							ПартнерыСегмента.Сегмент = &СегментТендер)) КАК ВыручкаИСебестоимостьПродажОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМенеджерыГрузовогоОтделаПартнеров КАК втМенеджерыГрузовогоОтделаПартнеров
			|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = втМенеджерыГрузовогоОтделаПартнеров.Партнер
			|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговорГрузовойОтдел КАК ДоговорГрузовойОтдел
			|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор = ДоговорГрузовойОтдел.Договор
			|		ЛЕВОЕ СОЕДИНЕНИЕ втСоглашениеГрузовойОтдел КАК СоглашениеГрузовойОтдел
			|		ПО ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Соглашение = СоглашениеГрузовойОтдел.Соглашение
			|ГДЕ
			|	(ДоговорГрузовойОтдел.ГрузовойОтдел = ИСТИНА
			|			ИЛИ СоглашениеГрузовойОтдел.ГрузовойОтдел = ИСТИНА)
			|	И ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&списокТоваров)
			|	И втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела = &Менеджер
			|СГРУППИРОВАТЬ ПО
			|	втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела";
			
			Запрос.УстановитьПараметр("НачалоПериода",Месяц);
			Запрос.УстановитьПараметр("ОкончаниеПериода",КонецМесяца(Месяц));
			Запрос.УстановитьПараметр("СвойствоМенеджерГрузовогоОтдела",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Менеджер Грузового отдела продаж"));
			Запрос.УстановитьПараметр("Рубль",Справочники.Валюты.НайтиПоКоду("643"));
			
			массивОрганизацииЭксклюзив = Новый Массив;
			массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив",Истина));
			массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив СПб",Истина));
			Запрос.УстановитьПараметр("ОрганизацииЭксклюзив",массивОрганизацииЭксклюзив);
			
			массивОрганизацииЭкомодуль = Новый Массив;
			массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль",Истина));
			массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль-СПб",Истина));
			Запрос.УстановитьПараметр("ОрганизацииЭкомодуль",массивОрганизацииЭкомодуль);
			
			Запрос.УстановитьПараметр("ГрузовойОтдел",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Грузовой отдел",Истина));
			
			Запрос.УстановитьПараметр("СегментТендер",Справочники.СегментыПартнеров.НайтиПоНаименованию("ТЕНДЕР",Истина));
			
			Запрос.УстановитьПараметр("СписокТоваров",Товары.ВыгрузитьЗначения());
			Запрос.УстановитьПараметр("Менеджер",Менеджер);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.КоличествоОборот;
			КонецЕсли;
			
		ИначеЕсли Показатель.Родитель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ПланПоПродажамСписокМенеджеров Тогда
			
			строкиПараметр = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Подразделение"));
			Подразделение = строкиПараметр[0].Значение.Получить();
			
			строкиПараметр = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Список менеджеров"));
			СписокМенеджеров = строкиПараметр[0].Значение.Получить();
			
			строкиПараметр = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Организация"));
			Организация = строкиПараметр[0].Значение.Получить();
			
			строкиПараметр = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Склады"));
			Склады = строкиПараметр[0].Значение.Получить();
			
			строкиПараметр = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Только грузовой отдел"));
			ТолькоГрузовой = строкиПараметр[0].Значение.Получить();
			
			//Самойлов А.С. Начало 2018-05-11 #1537
			строкиПараметр = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Прибыль вместо выручки"));
			ПрибыльВместоВыручки = строкиПараметр[0].Значение.Получить();
			//Самойлов А.С. Конец  2018-05-11
						
			Результат = 0;
			Для Каждого стрОборот Из тзОборотСФильтрами Цикл
				
				Если ЗначениеЗаполнено(Организация) И НЕ стрОборот.Организация = Организация Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Подразделение) И Подразделение.НайтиПоЗначению(стрОборот.Подразделение) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Склады) И Склады.НайтиПоЗначению(стрОборот.Склад) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СписокМенеджеров) И СписокМенеджеров.НайтиПоЗначению(стрОборот.МенеджерГрузовогоОтдела) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТолькоГрузовой = Истина И НЕ стрОборот.ЭтоГрузовойОтдел Тогда
					Продолжить;
				КонецЕсли;
				
				//Самойлов А.С. Начало 2018-05-11 #1537
				Если НЕ ПрибыльВместоВыручки Тогда
				//Самойлов А.С. Конец  2018-05-11
					Результат = Результат + стрОборот.СуммаВыручкиОборот;
				//Самойлов А.С. Начало 2018-05-11 #1537
				Иначе
					Результат = Результат + стрОборот.ПрибыльОборот;
				КонецЕсли;
				//Самойлов А.С. Конец  2018-05-11
				
			КонецЦикла;
			
			Возврат Результат;
			
		//Самойлов А.С. Начало 2018-05-11 #1537
		ИначеЕсли Показатель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела._ПланПоОборотуОбщий Тогда
			
			строкиДанныеПоВыручке = тзВыручка.НайтиСтроки(Новый Структура("Менеджер,Клиент",Менеджер,"СВОИ"));
			
			Если строкиДанныеПоВыручке.Количество() > 0 Тогда
				
				ДанныеВыручки = строкиДанныеПоВыручке[0];				                 
				Возврат  ДанныеВыручки.СуммаВыручкиОборот;
				
			КонецЕсли;
				
		//Самойлов А.С. Конец  2018-05-11
		//Самойлов А.С. Начало 2018-11-23 #4000
		ИначеЕсли Показатель.Родитель = Справочники.Экс_KPIМенеджеровГрузовогоОтдела._ПланПоОборотуОбщий Тогда
			
			строкиПараметр = Показатель.ЗначенияПараметров.НайтиСтроки(Новый Структура("Параметр","Партнер"));
			Партнер = строкиПараметр[0].Значение.Получить();
						
			строкиДанныеПоВыручке = тзВыручка.НайтиСтроки(Новый Структура("Менеджер,Клиент",Менеджер,Партнер));
			
			Если строкиДанныеПоВыручке.Количество() > 0 Тогда
				
				ДанныеВыручки = строкиДанныеПоВыручке[0];				                 
				Возврат  ДанныеВыручки.СуммаВыручкиОборот;
				
			КонецЕсли;
		//Самойлов А.С. Конец  2018-11-23		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ПолучитьKPIМенеджера(Менеджер,ТаблицаПоказателейМенеджеров,тзВыручка = Неопределено,тзКолеса = Неопределено,тзОборотСФильтрами = Неопределено)
	
	ТаблицаKPI = Новый ТаблицаЗначений;
	ТаблицаKPI.Колонки.Добавить("Показатель",Новый ОписаниеТипов("СправочникСсылка.Экс_KPIМенеджеровГрузовогоОтдела"));
	ТаблицаKPI.Колонки.Добавить("Вес",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,2)));
	ТаблицаKPI.Колонки.Добавить("План",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	ТаблицаKPI.Колонки.Добавить("Факт",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	ТаблицаKPI.Колонки.Добавить("ПроцентВыполнения",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,2)));
	ТаблицаKPI.Колонки.Добавить("СУчетомВеса",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,2)));
	ТаблицаKPI.Колонки.Добавить("СУчетомВесаВРублях",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,2)));
		
	строкиПоказателиМенеджера = ТаблицаПоказателейМенеджеров.НайтиСтроки(Новый Структура("Менеджер",Менеджер));
	
	Для Каждого строкаПоказатель Из строкиПоказателиМенеджера Цикл
		
		Показатель = строкаПоказатель.Показатель;
		новСтрокаKPI = ТаблицаKPI.Добавить();
		новСтрокаKPI.Показатель = Показатель;
		новСтрокаKPI.Вес = строкаПоказатель.Вес;
		новСтрокаKPI.План = ПолучитьПланПоПоказателюПоМенеджеру(НачалоМесяца(ДатаНачала),Менеджер,Показатель);
		новСтрокаKPI.Факт = ПолучитьФактПоПоказателюПоМенеджеру(НачалоМесяца(ДатаНачала),Менеджер,Показатель,тзВыручка,тзКолеса,тзОборотСФильтрами);
		
		Если Показатель.ДаНет Тогда
			Если НЕ Показатель.ОбратноеСравнение Тогда
				Если новСтрокаKPI.Факт >= новСтрокаKPI.План Тогда
					новСтрокаKPI.ПроцентВыполнения = 100;
				Иначе
					новСтрокаKPI.ПроцентВыполнения = 0;
				КонецЕсли;
			Иначе
				Если новСтрокаKPI.Факт <= новСтрокаKPI.План Тогда
					новСтрокаKPI.ПроцентВыполнения = 100;
				Иначе
					новСтрокаKPI.ПроцентВыполнения = 0;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если новСтрокаKPI.План > 0 Тогда
				новСтрокаKPI.ПроцентВыполнения = Окр(100 * новСтрокаKPI.Факт / новСтрокаKPI.План,0);
			Иначе
				новСтрокаKPI.ПроцентВыполнения = 0;
			КонецЕсли;
		КонецЕсли;
		
		новСтрокаKPI.СУчетомВеса = новСтрокаKPI.ПроцентВыполнения * новСтрокаKPI.Вес / 100;
				
	КонецЦикла;
	
	Возврат ТаблицаKPI;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуОборотовСФильтрами(Месяц)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер,
	|	ПартнерыДополнительныеРеквизиты.Значение КАК МенеджерГрузовогоОтдела
	|ПОМЕСТИТЬ втМенеджерыГрузовогоОтделаПартнеров
	|ИЗ
	|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоМенеджерГрузовогоОтдела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Пользователь КАК СотрудникГрузовогоОтдела
	|ПОМЕСТИТЬ втСотрудникиГрузовогоОтдела
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Ссылка В(&ГруппыПользователейГрузовойОтдел)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка КАК Договор,
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
	|ПОМЕСТИТЬ втДоговорГрузовойОтдел
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
	|ГДЕ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияСКлиентамиДополнительныеРеквизиты.Ссылка КАК Соглашение,
	|	СоглашенияСКлиентамиДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
	|ПОМЕСТИТЬ втСоглашениеГрузовойОтдел
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияСКлиентамиДополнительныеРеквизиты
	|ГДЕ
	|	СоглашенияСКлиентамиДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела КАК МенеджерГрузовогоОтдела,
	|	ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,
	|	ВыручкаИСебестоимостьПродажОбороты.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭксклюзив)
	|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭкомодуль)
	|					И ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер В
	|						(ВЫБРАТЬ
	|							ПартнерыСегмента.Партнер
	|						ИЗ
	|							РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|						ГДЕ
	|							ПартнерыСегмента.Сегмент = &СегментТендер)
	|			ТОГДА ""Эксклюзив""
	|		ИНАЧЕ ""Экомодуль""
	|	КОНЕЦ КАК Организация,
	|	ЕСТЬNULL(ВЫБОР КОГДА ((ДоговорГрузовойОтдел.ГрузовойОтдел = ИСТИНА
	|			ИЛИ СоглашениеГрузовойОтдел.ГрузовойОтдел = ИСТИНА
	|			ИЛИ НЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор.КассоваяСмена ЕСТЬ NULL
	|				И НЕ втСотрудникиГрузовогоОтдела.СотрудникГрузовогоОтдела ЕСТЬ NULL)
	|	И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ(&Грузовые)
	|			ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ(&Легкогрузовые))) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ,ЛОЖЬ) КАК ЭтоГрузовойОтдел,
	|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК КоличествоОборот,
	|	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот КАК СуммаВыручкиОборот,
	//Самойлов А.С. Начало 2018-05-11 #1537
	|	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот - ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот КАК ПрибыльОборот
	//Самойлов А.С. Конец  2018-05-11
	|ПОМЕСТИТЬ втРезультатБезГруппировки
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втМенеджерыГрузовогоОтделаПартнеров КАК втМенеджерыГрузовогоОтделаПартнеров
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = втМенеджерыГрузовогоОтделаПартнеров.Партнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговорГрузовойОтдел КАК ДоговорГрузовойОтдел
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор = ДоговорГрузовойОтдел.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоглашениеГрузовойОтдел КАК СоглашениеГрузовойОтдел
	|		ПО ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Соглашение = СоглашениеГрузовойОтдел.Соглашение
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСотрудникиГрузовогоОтдела КАК втСотрудникиГрузовогоОтдела
	|		ПО ВыручкаИСебестоимостьПродажОбороты.Менеджер = втСотрудникиГрузовогоОтдела.СотрудникГрузовогоОтдела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультатБезГруппировки.МенеджерГрузовогоОтдела КАК МенеджерГрузовогоОтдела,
	|	втРезультатБезГруппировки.Подразделение КАК Подразделение,
	|	втРезультатБезГруппировки.Склад КАК Склад,
	|	втРезультатБезГруппировки.Организация КАК Организация,
	|	втРезультатБезГруппировки.ЭтоГрузовойОтдел КАК ЭтоГрузовойОтдел,
	|	СУММА(втРезультатБезГруппировки.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(втРезультатБезГруппировки.СуммаВыручкиОборот) КАК СуммаВыручкиОборот,
	//Самойлов А.С. Начало 2018-05-11 #1537
	|	СУММА(втРезультатБезГруппировки.ПрибыльОборот) КАК ПрибыльОборот
	//Самойлов А.С. Конец  2018-05-11	
	|ИЗ
	|	втРезультатБезГруппировки КАК втРезультатБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	втРезультатБезГруппировки.МенеджерГрузовогоОтдела,
	|	втРезультатБезГруппировки.Подразделение,
	|	втРезультатБезГруппировки.Склад,
	|	втРезультатБезГруппировки.Организация,
	|	втРезультатБезГруппировки.ЭтоГрузовойОтдел";
	
	Запрос.УстановитьПараметр("НачалоПериода",Месяц);
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("СвойствоМенеджерГрузовогоОтдела",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Менеджер Грузового отдела продаж"));
	Запрос.УстановитьПараметр("Рубль",Справочники.Валюты.НайтиПоКоду("643"));
	
	массивОрганизацииЭксклюзив = Новый Массив;
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив",Истина));
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив СПб",Истина));
	//Самойлов А.С. Начало 2018-07-04 #
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Тышкевич Наталья Николаевна ИП",Истина));
	//Самойлов А.С. Конец  2018-07-04
	//Самойлов А.С. Начало 2018-11-14 #
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Сперанский Александр Николаевич ИП",Истина));
	//Самойлов А.С. Конец  2018-11-14
	Запрос.УстановитьПараметр("ОрганизацииЭксклюзив",массивОрганизацииЭксклюзив);
	
	массивОрганизацииЭкомодуль = Новый Массив;
	массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль",Истина));
	массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль-СПб",Истина));
	Запрос.УстановитьПараметр("ОрганизацииЭкомодуль",массивОрганизацииЭкомодуль);
	
	Запрос.УстановитьПараметр("ГрузовойОтдел",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Грузовой отдел",Истина));
	
	Запрос.УстановитьПараметр("СегментТендер",Справочники.СегментыПартнеров.НайтиПоНаименованию("ТЕНДЕР",Истина));
	
	//Самойлов А.С. Начало 2018-07-04 #
	Запрос.УстановитьПараметр("Грузовые",Справочники.Номенклатура.НайтиПоНаименованию("ГРУЗОВЫЕ",Истина,Справочники.Номенклатура.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Легкогрузовые",Справочники.Номенклатура.НайтиПоНаименованию("АВТОШИНА ЛЕГКОГРУЗОВАЯ С",Истина,Справочники.Номенклатура.ПустаяСсылка()));
		
	
	тзНастройки = ХранилищеОбщихНастроек.Загрузить("НастройкиЭксклюзив","ГруппыПользователейМотивацииГрузовогоОтдела",,"НастройкиЭксклюзив");
		
	Если ТипЗнч(тзНастройки) = Тип("ТаблицаЗначений") И тзНастройки.Количество() > 0 Тогда		
		СписокГрупп = тзНастройки.ВыгрузитьКолонку("ГруппаПользователей");		
	Иначе
		ВызватьИсключение "Нет настроек";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ГруппыПользователейГрузовойОтдел",СписокГрупп);
	//Самойлов А.С. Конец  2018-07-04
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура Старт(Команда)
	//ВыводОтчета();
	Если ПечатьНаСервере() = -1 Тогда
		ПоказатьПредупреждение(,"Нет прав");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводОтчета()
	//ТЗВывода = ПечатьНаСервере();
	//ТЗВывода.Показать("Простой отчёт")
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	Если СтрНайти(ПараметрыСеанса.ТекущийПользователь.Наименование,"Самойлов") = 0
		И СтрНайти(ПараметрыСеанса.ТекущийПользователь.Наименование,"Тышкевич") = 0 Тогда
		
	//Самойлов А.С. Начало 2018-04-18 #1002
		//Возврат -1;
		РежимАдминистратора = Ложь;
		
	Иначе
		
		РежимАдминистратора = Истина;
	КонецЕсли;
	//Самойлов А.С. Конец  2018-04-18
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаЦенБрендов = ХранилищеОбщихНастроек.Загрузить("МотивацияГО","ЦеныКолес",,"МотивацияГО");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("МотивацияМенеджеров");
	
	ОбластьПропускСтроки = Макет.ПолучитьОбласть("ПропускСтроки");
	ОбластьМенеджерЗаголовок = Макет.ПолучитьОбласть("МенеджерЗаголовок");
	ОбластьМенеджерСтрока = Макет.ПолучитьОбласть("МенеджерСтрока");
	ОбластьМенеджерИтого = Макет.ПолучитьОбласть("МенеджерИтого");
	ОбластьДанныеЗаголовок = Макет.ПолучитьОбласть("ДанныеЗаголовок|Шины");
	ОбластьДанныеСтрока = Макет.ПолучитьОбласть("ДанныеСтрока|Шины");
	ОбластьДанныеИтого = Макет.ПолучитьОбласть("ДанныеИтого|Шины");
	
	ОбластьДанныеПропускСтроки = Макет.ПолучитьОбласть("ПропускСтроки|Шины");
	
	ОбластьДанныеKPIЗаголовок = Макет.ПолучитьОбласть("ДанныеЗаголовок|KPI");
	ОбластьДанныеKPIСтрока = Макет.ПолучитьОбласть("ДанныеСтрока|KPI");
	ОбластьДанныеKPIИтого = Макет.ПолучитьОбласть("ДанныеИтого|KPI");
	
		
	тзОбособленныеКлиенты = Новый ТаблицаЗначений;
	тзОбособленныеКлиенты.Колонки.Добавить("Менеджер",Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	тзОбособленныеКлиенты.Колонки.Добавить("Клиент",Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	
	ЗапросТаблицыОбособленныхКлиентов = Новый Запрос;
	ЗапросТаблицыОбособленныхКлиентов.Текст =
	"ВЫБРАТЬ
	|	ПользователиДополнительныеРеквизиты.Ссылка КАК Менеджер,
	|	ПользователиДополнительныеРеквизиты.Значение КАК ТаблицаСтрокой
	|ИЗ
	|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	|ГДЕ
	|	ПользователиДополнительныеРеквизиты.Свойство = &СвойствоОбособка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПользователиДополнительныеРеквизиты.Ссылка.Наименование";
	
	ЗапросТаблицыОбособленныхКлиентов.УстановитьПараметр("СвойствоОбособка",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Таблица партнеров для мотивации"));
	
	ВыборкаОбособка = ЗапросТаблицыОбособленныхКлиентов.Выполнить().Выбрать();
	
	Пока ВыборкаОбособка.Следующий() Цикл
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ВыборкаОбособка.ТаблицаСтрокой);
		Попытка
	       	массивДанные = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого стрДанные Из массивДанные Цикл
			
			новСтрОбособленныеКлиенты = тзОбособленныеКлиенты.Добавить();
			новСтрОбособленныеКлиенты.Менеджер = ВыборкаОбособка.Менеджер;
			новСтрОбособленныеКлиенты.Клиент = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(стрДанные.Партнер));
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ втОбособленныеКлиентыМенеджеров
	|ИЗ &ОбособленныеКлиенты КАК ОбособленныеКлиенты	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Пользователь КАК СотрудникГрузовогоОтдела
	|ПОМЕСТИТЬ втСотрудникиГрузовогоОтдела
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Ссылка В(&ГруппыПользователейГрузовойОтдел)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Номенклатура,
	|	ДополнительныеСведения.Значение КАК ГруппаДляМотивации
	|ПОМЕСТИТЬ втГруппыДляМотивации
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &ГруппаДляМотивации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Р1,
	|	Номенклатура.Родитель.Родитель КАК Р2,
	|	Номенклатура.Родитель.Родитель.Родитель КАК Р3,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель КАК Р4,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель КАК Р5,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель КАК Р6
	|ПОМЕСТИТЬ втВсеРодители
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты.АналитикаУчетаНоменклатуры.Номенклатура
	|			ИЗ
	|				РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &ОкончаниеПериода, ПЕРИОД, АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭксклюзив)
	|					ИЛИ АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭкомодуль)
	|						И АналитикаУчетаПоПартнерам.Партнер В
	|							(ВЫБРАТЬ
	|								ПартнерыСегмента.Партнер
	|							ИЗ
	|								РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|							ГДЕ
	|								ПартнерыСегмента.Сегмент = &СегментТендер)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеРодители.Ссылка КАК Номенклатура,
	|	втГруппыДляМотивации1.ГруппаДляМотивации КАК Г1,
	|	втГруппыДляМотивации2.ГруппаДляМотивации КАК Г2,
	|	втГруппыДляМотивации3.ГруппаДляМотивации КАК Г3,
	|	втГруппыДляМотивации4.ГруппаДляМотивации КАК Г4,
	|	втГруппыДляМотивации5.ГруппаДляМотивации КАК Г5,
	|	втГруппыДляМотивации6.ГруппаДляМотивации КАК Г6
	|ПОМЕСТИТЬ втВсеГруппы
	|ИЗ
	|	втВсеРодители КАК втВсеРодители
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГруппыДляМотивации КАК втГруппыДляМотивации1
	|		ПО втВсеРодители.Р1 = втГруппыДляМотивации1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГруппыДляМотивации КАК втГруппыДляМотивации2
	|		ПО втВсеРодители.Р2 = втГруппыДляМотивации2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГруппыДляМотивации КАК втГруппыДляМотивации3
	|		ПО втВсеРодители.Р3 = втГруппыДляМотивации3.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГруппыДляМотивации КАК втГруппыДляМотивации4
	|		ПО втВсеРодители.Р4 = втГруппыДляМотивации4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГруппыДляМотивации КАК втГруппыДляМотивации5
	|		ПО втВсеРодители.Р5 = втГруппыДляМотивации5.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГруппыДляМотивации КАК втГруппыДляМотивации6
	|		ПО втВсеРодители.Р6 = втГруппыДляМотивации6.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеГруппы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ втВсеГруппы.Г1 ЕСТЬ NULL
	|				И НЕ втВсеГруппы.Г1 = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	|			ТОГДА втВсеГруппы.Г1
	|		КОГДА НЕ втВсеГруппы.Г2 ЕСТЬ NULL
	|				И НЕ втВсеГруппы.Г2 = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	|			ТОГДА втВсеГруппы.Г2
	|		КОГДА НЕ втВсеГруппы.Г3 ЕСТЬ NULL
	|				И НЕ втВсеГруппы.Г3 = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	|			ТОГДА втВсеГруппы.Г3
	|		КОГДА НЕ втВсеГруппы.Г4 ЕСТЬ NULL
	|				И НЕ втВсеГруппы.Г4 = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	|			ТОГДА втВсеГруппы.Г4
	|		КОГДА НЕ втВсеГруппы.Г5 ЕСТЬ NULL
	|				И НЕ втВсеГруппы.Г5 = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	|			ТОГДА втВсеГруппы.Г5
	|		КОГДА НЕ втВсеГруппы.Г6 ЕСТЬ NULL
	|				И НЕ втВсеГруппы.Г6 = ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)
	|			ТОГДА втВсеГруппы.Г6
	|		ИНАЧЕ ""Прочие""
	|	КОНЕЦ КАК ГруппаДляМотивации
	|ПОМЕСТИТЬ втГруппы
	|ИЗ
	|	втВсеГруппы КАК втВсеГруппы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер,
	|	ПартнерыДополнительныеРеквизиты.Значение КАК МенеджерГрузовогоОтдела
	|ПОМЕСТИТЬ втМенеджерыГрузовогоОтделаПартнеров
	|ИЗ
	|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
	|ГДЕ
	|	ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоМенеджерГрузовогоОтдела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка КАК Договор,
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
	|ПОМЕСТИТЬ втДоговорГрузовойОтдел
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
	|ГДЕ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияСКлиентамиДополнительныеРеквизиты.Ссылка КАК Соглашение,
	|	СоглашенияСКлиентамиДополнительныеРеквизиты.Значение КАК ГрузовойОтдел
	|ПОМЕСТИТЬ втСоглашениеГрузовойОтдел
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.ДополнительныеРеквизиты КАК СоглашенияСКлиентамиДополнительныеРеквизиты
	|ГДЕ
	|	СоглашенияСКлиентамиДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоглашенияСПоставщикамиДополнительныеРеквизиты.Ссылка,
	|	СоглашенияСПоставщикамиДополнительныеРеквизиты.Значение	
	|ИЗ
	|	Справочник.СоглашенияСПоставщиками.ДополнительныеРеквизиты КАК СоглашенияСПоставщикамиДополнительныеРеквизиты
	|ГДЕ
	|	СоглашенияСПоставщикамиДополнительныеРеквизиты.Свойство = &ГрузовойОтдел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела КАК МенеджерГрузовогоОтдела,
	|	РасчетыСКлиентамиОстаткиИОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	СУММА(РасчетыСКлиентамиОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ втОстаткиРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			ПЕРИОД,
	|			,
	|			Валюта = &Рубль
	|				И (АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭксклюзив)
	|					ИЛИ АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭкомодуль)
	|						И АналитикаУчетаПоПартнерам.Партнер В
	|							(ВЫБРАТЬ
	|								ПартнерыСегмента.Партнер
	|							ИЗ
	|								РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|							ГДЕ
	|								ПартнерыСегмента.Сегмент = &СегментТендер))) КАК РасчетыСКлиентамиОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМенеджерыГрузовогоОтделаПартнеров КАК МенеджерыГрузовогоОтделаПартнеров
	|		ПО (МенеджерыГрузовогоОтделаПартнеров.Партнер = РасчетыСКлиентамиОстаткиИОбороты.АналитикаУчетаПоПартнерам.Партнер)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговорГрузовойОтдел КАК ДоговорГрузовойОтдел
	|		ПО РасчетыСКлиентамиОстаткиИОбороты.АналитикаУчетаПоПартнерам.Договор = ДоговорГрузовойОтдел.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоглашениеГрузовойОтдел КАК СоглашениеГрузовойОтдел
	|		ПО РасчетыСКлиентамиОстаткиИОбороты.ЗаказКлиента.Соглашение = СоглашениеГрузовойОтдел.Соглашение
	|ГДЕ
	|	(ДоговорГрузовойОтдел.ГрузовойОтдел = ИСТИНА
	|			ИЛИ СоглашениеГрузовойОтдел.ГрузовойОтдел = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	МенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела,
	|	РасчетыСКлиентамиОстаткиИОбороты.АналитикаУчетаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела КАК МенеджерГрузовогоОтдела,
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ЕСТЬNULL(втГруппы.ГруппаДляМотивации, ""Прочие"") КАК ГруппаДляМотивации,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручкиОборот,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот - ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот) КАК ПрибыльОборот
	|ПОМЕСТИТЬ втПродажиКолесПоКлиентам
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			Регистратор,
	|			АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭксклюзив)
	|				ИЛИ АналитикаУчетаПоПартнерам.Организация В (&ОрганизацииЭкомодуль)
	|					И АналитикаУчетаПоПартнерам.Партнер В
	|						(ВЫБРАТЬ
	|							ПартнерыСегмента.Партнер
	|						ИЗ
	|							РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	|						ГДЕ
	|							ПартнерыСегмента.Сегмент = &СегментТендер)) КАК ВыручкаИСебестоимостьПродажОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМенеджерыГрузовогоОтделаПартнеров КАК втМенеджерыГрузовогоОтделаПартнеров
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер = втМенеджерыГрузовогоОтделаПартнеров.Партнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДоговорГрузовойОтдел КАК ДоговорГрузовойОтдел
	|		ПО ВыручкаИСебестоимостьПродажОбороты.Регистратор.Договор = ДоговорГрузовойОтдел.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоглашениеГрузовойОтдел КАК СоглашениеГрузовойОтдел
	|		ПО ВыручкаИСебестоимостьПродажОбороты.Регистратор.Соглашение = СоглашениеГрузовойОтдел.Соглашение
	|		ЛЕВОЕ СОЕДИНЕНИЕ втГруппы КАК втГруппы
	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура = втГруппы.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСотрудникиГрузовогоОтдела КАК втСотрудникиГрузовогоОтдела
	|		ПО ВыручкаИСебестоимостьПродажОбороты.Менеджер = втСотрудникиГрузовогоОтдела.СотрудникГрузовогоОтдела
	|ГДЕ
	|	(ДоговорГрузовойОтдел.ГрузовойОтдел = ИСТИНА
	|			ИЛИ СоглашениеГрузовойОтдел.ГрузовойОтдел = ИСТИНА
	|			ИЛИ НЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор.КассоваяСмена ЕСТЬ NULL)
	//|				И НЕ втСотрудникиГрузовогоОтдела.СотрудникГрузовогоОтдела ЕСТЬ NULL)
	|	И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ(&Грузовые)
	|			ИЛИ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ(&Легкогрузовые))
	|
	|СГРУППИРОВАТЬ ПО
	|	втМенеджерыГрузовогоОтделаПартнеров.МенеджерГрузовогоОтдела,
	|	ЕСТЬNULL(втГруппы.ГруппаДляМотивации, ""Прочие""),
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстаткиРасчетов.МенеджерГрузовогоОтдела КАК МенеджерГрузовогоОтдела,
	|	ВЫБОР
	|		КОГДА НЕ втОбособленныеКлиентыМенеджеров.Клиент ЕСТЬ NULL
	|			ТОГДА втОбособленныеКлиентыМенеджеров.Клиент
	|		ИНАЧЕ ""СВОИ""
	|	КОНЕЦ КАК Клиент,
	|	СУММА(втОстаткиРасчетов.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(втОстаткиРасчетов.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ втРасчеты
	|ИЗ
	|	втОстаткиРасчетов КАК втОстаткиРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОбособленныеКлиентыМенеджеров КАК втОбособленныеКлиентыМенеджеров
	|		ПО (втОбособленныеКлиентыМенеджеров.Менеджер = втОстаткиРасчетов.МенеджерГрузовогоОтдела)
	|			И втОстаткиРасчетов.Партнер = втОбособленныеКлиентыМенеджеров.Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|	втОстаткиРасчетов.МенеджерГрузовогоОтдела,
	|	ВЫБОР
	|		КОГДА НЕ втОбособленныеКлиентыМенеджеров.Клиент ЕСТЬ NULL
	|			ТОГДА втОбособленныеКлиентыМенеджеров.Клиент
	|		ИНАЧЕ ""СВОИ""
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиКолесПоКлиентам.МенеджерГрузовогоОтдела КАК Менеджер,
	|	ВЫБОР
	|		КОГДА НЕ втОбособленныеКлиентыМенеджеров.Клиент ЕСТЬ NULL
	|			ТОГДА втОбособленныеКлиентыМенеджеров.Клиент
	|		ИНАЧЕ ""СВОИ""
	|	КОНЕЦ КАК Клиент,
	|	втПродажиКолесПоКлиентам.ГруппаДляМотивации КАК Бренд,
	|	СУММА(втПродажиКолесПоКлиентам.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(втПродажиКолесПоКлиентам.СуммаВыручкиОборот) КАК СуммаВыручкиОборот,
	|	СУММА(втПродажиКолесПоКлиентам.ПрибыльОборот) КАК ПрибыльОборот
	|ПОМЕСТИТЬ втПродажиКолес
	|ИЗ
	|	втПродажиКолесПоКлиентам КАК втПродажиКолесПоКлиентам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОбособленныеКлиентыМенеджеров КАК втОбособленныеКлиентыМенеджеров
	|		ПО втПродажиКолесПоКлиентам.Партнер = втОбособленныеКлиентыМенеджеров.Клиент
	|			И (втОбособленныеКлиентыМенеджеров.Менеджер = втПродажиКолесПоКлиентам.МенеджерГрузовогоОтдела)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажиКолесПоКлиентам.МенеджерГрузовогоОтдела,
	|	ВЫБОР
	|		КОГДА НЕ втОбособленныеКлиентыМенеджеров.Клиент ЕСТЬ NULL
	|			ТОГДА втОбособленныеКлиентыМенеджеров.Клиент
	|		ИНАЧЕ ""СВОИ""
	|	КОНЕЦ,
	|	втПродажиКолесПоКлиентам.ГруппаДляМотивации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажиКолес.Менеджер КАК Менеджер,
	|	втПродажиКолес.Клиент КАК Клиент,
	|	втПродажиКолес.Бренд КАК Бренд,
	|	втПродажиКолес.КоличествоОборот КАК КоличествоОборот,
	|	втПродажиКолес.СуммаВыручкиОборот КАК СуммаВыручкиОборот,
	|	втПродажиКолес.ПрибыльОборот КАК ПрибыльОборот
	|ИЗ
	|	втПродажиКолес КАК втПродажиКолес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасчеты.МенеджерГрузовогоОтдела КАК Менеджер,
	|	втРасчеты.Клиент КАК Клиент,
	|	втРасчеты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	втРасчеты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	СУММА(ЕСТЬNULL(втПродажиКолес.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
	|	СУММА(ЕСТЬNULL(втПродажиКолес.ПрибыльОборот, 0)) КАК ПрибыльОборот,
	|	СУММА(ЕСТЬNULL(втПродажиКолес.КоличествоОборот, 0)) КАК КоличествоОборот
	|ИЗ
	|	втРасчеты КАК втРасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажиКолес КАК втПродажиКолес
	|		ПО втРасчеты.МенеджерГрузовогоОтдела = втПродажиКолес.Менеджер
	|			И втРасчеты.Клиент = втПродажиКолес.Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|	втРасчеты.МенеджерГрузовогоОтдела,
	|	втРасчеты.Клиент,
	|	втРасчеты.СуммаНачальныйОстаток,
	|	втРасчеты.СуммаКонечныйОстаток";
	
	Запрос.УстановитьПараметр("ОбособленныеКлиенты",тзОбособленныеКлиенты);
	
	Запрос.УстановитьПараметр("НачалоПериода",ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("СвойствоМенеджерГрузовогоОтдела",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Менеджер Грузового отдела продаж"));
	Запрос.УстановитьПараметр("Рубль",Справочники.Валюты.НайтиПоКоду("643"));
	
	массивОрганизацииЭксклюзив = Новый Массив;
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив",Истина));
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Эксклюзив СПб",Истина));
	//Самойлов А.С. Начало 2018-07-04 #
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Тышкевич Наталья Николаевна ИП",Истина));
	//Самойлов А.С. Конец  2018-07-04
	//Самойлов А.С. Начало 2018-11-14 #
	массивОрганизацииЭксклюзив.Добавить(Справочники.Организации.НайтиПоНаименованию("Сперанский Александр Николаевич ИП",Истина));
	//Самойлов А.С. Конец  2018-11-14
	Запрос.УстановитьПараметр("ОрганизацииЭксклюзив",массивОрганизацииЭксклюзив);
	
	массивОрганизацииЭкомодуль = Новый Массив;
	массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль",Истина));
	массивОрганизацииЭкомодуль.Добавить(Справочники.Организации.НайтиПоНаименованию("Экомодуль-СПб",Истина));
	Запрос.УстановитьПараметр("ОрганизацииЭкомодуль",массивОрганизацииЭкомодуль);
	
	Запрос.УстановитьПараметр("ГрузовойОтдел",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Грузовой отдел",Истина));
	
	Запрос.УстановитьПараметр("СегментТендер",Справочники.СегментыПартнеров.НайтиПоНаименованию("ТЕНДЕР",Истина));
	
	Запрос.УстановитьПараметр("ГруппаДляМотивации",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Группа для расчета мотивации"));
	
	//Самойлов А.С. Начало 2018-07-04 #
	Запрос.УстановитьПараметр("Грузовые",Справочники.Номенклатура.НайтиПоНаименованию("ГРУЗОВЫЕ",Истина,Справочники.Номенклатура.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Легкогрузовые",Справочники.Номенклатура.НайтиПоНаименованию("АВТОШИНА ЛЕГКОГРУЗОВАЯ С",Истина,Справочники.Номенклатура.ПустаяСсылка()));
	//Самойлов А.С. Конец  2018-07-04
	
	
	тзНастройки = ХранилищеОбщихНастроек.Загрузить("НастройкиЭксклюзив","ГруппыПользователейМотивацииГрузовогоОтдела",,"НастройкиЭксклюзив");
		
	Если ТипЗнч(тзНастройки) = Тип("ТаблицаЗначений") И тзНастройки.Количество() > 0 Тогда		
		СписокГрупп = тзНастройки.ВыгрузитьКолонку("ГруппаПользователей");		
	Иначе
		ВызватьИсключение "Нет настроек";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ГруппыПользователейГрузовойОтдел",СписокГрупп);

	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Результаты = Запрос.ВыполнитьПакет();	
	
	тзВыручка = Результаты[14].Выгрузить();
	тзКолеса = Результаты[13].Выгрузить();
	
	ЗапросМанагерыДляРасчета = Новый Запрос;
	ЗапросМанагерыДляРасчета.Текст =
	//Самойлов А.С. Начало 2018-05-11 #1537	
	//"ВЫБРАТЬ
	//|	ПользователиДополнительныеРеквизиты.Ссылка КАК Менеджер
	//|ИЗ
	//|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	//|ГДЕ
	//|	ПользователиДополнительныеРеквизиты.Свойство = &СвойствоРасчет
	//|	И ПользователиДополнительныеРеквизиты.Значение = ИСТИНА
	//|УПОРЯДОЧИТЬ ПО
	//|	ПользователиДополнительныеРеквизиты.Ссылка.Наименование";
	"ВЫБРАТЬ
	|	ПользователиДополнительныеРеквизиты.Ссылка КАК Менеджер,
	|	ГруппыПользователей.Группа КАК Группа
	|ИЗ
	|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГруппыПользователейСостав.Пользователь КАК Пользователь,
	|			МАКСИМУМ(ГруппыПользователейСостав.Ссылка) КАК Группа
	|		ИЗ
	|			Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ГДЕ
	|			ГруппыПользователейСостав.Ссылка В (&ГруппыПользователей)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГруппыПользователейСостав.Пользователь) КАК ГруппыПользователей
	|		ПО ПользователиДополнительныеРеквизиты.Ссылка = ГруппыПользователей.Пользователь
	|ГДЕ
	|	ПользователиДополнительныеРеквизиты.Свойство = &СвойствоРасчет
	|	И ПользователиДополнительныеРеквизиты.Значение = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппыПользователей.Группа.Наименование,
	|	ПользователиДополнительныеРеквизиты.Ссылка.Наименование";
			
	ЗапросМанагерыДляРасчета.УстановитьПараметр("ГруппыПользователей",СписокГрупп);
	
	//Самойлов А.С. Конец  2018-05-11
	
	ЗапросМанагерыДляРасчета.УстановитьПараметр("СвойствоРасчет",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Расчет мотивации грузового отдела"));
	
	ВыборкаМанагеры = ЗапросМанагерыДляРасчета.Выполнить().Выбрать();
	
	//Самойлов А.С. Начало 2018-01-09 #373
	//Самойлов А.С. Начало 2018-09-04 #1932
	//ТаблицаПоказателейМенеджеров = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ПолучитьТаблицуПоказателейМенеджеров();
	ТаблицаПоказателейМенеджеров = Справочники.Экс_KPIМенеджеровГрузовогоОтдела.ПолучитьТаблицуПоказателейМенеджеров(ДатаНачала);
	//Самойлов А.С. Конец  2018-09-04
	//Самойлов А.С. Конец  2018-01-09
	
	//Самойлов А.С. Начало 2018-01-25 #373.2
	ТаблицаОборотовСФильтрами = ПолучитьТаблицуОборотовСФильтрами(НачалоМесяца(ДатаНачала));
	//Самойлов А.С. Конец  2018-01-25
	
	//Самойлов А.С. Начало 2018-05-11 #1537
	ТекущаяГруппа = Неопределено;
	//Самойлов А.С. Конец  2018-05-11
	
	Пока ВыборкаМанагеры.Следующий() Цикл
		
		//Самойлов А.С. Начало 2018-04-18 #1002
		Если НЕ РежимАдминистратора
			И НЕ ВыборкаМанагеры.Менеджер = ПараметрыСеанса.ТекущийПользователь Тогда
			
			Продолжить;
			
		КонецЕсли;
		//Самойлов А.С. Конец  2018-04-18
		
		//Самойлов А.С. Начало 2018-05-11 #1537
		Если ТекущаяГруппа <> ВыборкаМанагеры.Группа Тогда
			ОбластьГруппа = Макет.ПолучитьОбласть("ГруппаПользователей");
			ОбластьГруппа.Параметры.ГруппаПользователей = ВыборкаМанагеры.Группа;
			ТабДок.Вывести(ОбластьПропускСтроки);
			ТабДок.Вывести(ОбластьГруппа);			
			ТекущаяГруппа = ВыборкаМанагеры.Группа;
		КонецЕсли;		
		//Самойлов А.С. Конец  2018-05-11
		
		ТабДок.Вывести(ОбластьПропускСтроки);
		
		ОбластьМенеджерЗаголовок.Параметры.Менеджер = ВыборкаМанагеры.Менеджер.Наименование;
		ТабДок.Вывести(ОбластьМенеджерЗаголовок);
		
		строкиВыручка = тзВыручка.НайтиСтроки(Новый Структура("Менеджер",ВыборкаМанагеры.Менеджер));
		
		Если строкиВыручка.Количество() > 1 Тогда
			МногоКлиентов = Истина;
		Иначе
			МногоКлиентов = Ложь;
		КонецЕсли;
		
		Для Каждого строкаВыручка Из строкиВыручка Цикл
			
			ОбластьМенеджерСтрока.Параметры.Оборот = строкаВыручка.СуммаВыручкиОборот;
			ОбластьМенеджерСтрока.Параметры.Количество = строкаВыручка.КоличествоОборот;
			ОбластьМенеджерСтрока.Параметры.БылДолг = строкаВыручка.СуммаНачальныйОстаток;
			ОбластьМенеджерСтрока.Параметры.СталДолг = строкаВыручка.СуммаКонечныйОстаток;
			ОбластьМенеджерСтрока.Параметры.ИзменениеДолга = строкаВыручка.СуммаНачальныйОстаток - строкаВыручка.СуммаКонечныйОстаток;
			
			строкиКолеса = тзКолеса.НайтиСтроки(Новый Структура("Менеджер,Клиент",ВыборкаМанагеры.Менеджер,строкаВыручка.Клиент));
			
			ИтогоБонус = 0;
			
			Для Каждого строкаКолеса Из строкиКолеса Цикл
				
				строкаЦена = Неопределено;
				Если ТипЗнч(строкаКолеса.Бренд) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
					строкаЦена = ТаблицаЦенБрендов.Найти(строкаКолеса.Бренд,"Бренд");
				ИначеЕсли ТипЗнч(строкаКолеса.Бренд) = Тип("Строка") Тогда
					строкаЦена = ТаблицаЦенБрендов.Найти(Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка(),"Бренд");
				КонецЕсли;
				
				ЦенаКолеса = 0;
				Если строкаЦена <> Неопределено Тогда
					
					Если строкаВыручка.Клиент = "СВОИ" Тогда
						ЦенаКолеса = строкаЦена.ЦенаСвои;
					Иначе
						ЦенаКолеса = строкаЦена.ЦенаНеСвои;
					КонецЕсли;
					
				КонецЕсли;
				
				ИтогоБонус = ИтогоБонус + ЦенаКолеса * строкаКолеса.КоличествоОборот;
								
			КонецЦикла;
			
			Если строкаВыручка.КоличествоОборот <> Null И строкаВыручка.КоличествоОборот > 0 Тогда
				ОбластьМенеджерСтрока.Параметры.СредняяСтоимость = строкаВыручка.СуммаВыручкиОборот/строкаВыручка.КоличествоОборот;
				ОбластьМенеджерСтрока.Параметры.СреднийБонус = ИтогоБонус/строкаВыручка.КоличествоОборот;
			Иначе
				ОбластьМенеджерСтрока.Параметры.СредняяСтоимость = 0;
				ОбластьМенеджерСтрока.Параметры.СреднийБонус = 0;
			КонецЕсли;
			
			Если ОбластьМенеджерСтрока.Параметры.СредняяСтоимость > 0 Тогда
				ОбластьМенеджерСтрока.Параметры.КЗПЗаДолги = ОбластьМенеджерСтрока.Параметры.ИзменениеДолга * ОбластьМенеджерСтрока.Параметры.СреднийБонус / ОбластьМенеджерСтрока.Параметры.СредняяСтоимость;
			Иначе
				ОбластьМенеджерСтрока.Параметры.КЗПЗаДолги = 0;
			КонецЕсли;
			
			
			Если МногоКлиентов Тогда
				ОбластьМенеджерСтрока.Параметры.Клиент = строкаВыручка.Клиент;
			Иначе
				ОбластьМенеджерСтрока.Параметры.Клиент = Неопределено;
			КонецЕсли;			
			
			ТабДок.Вывести(ОбластьМенеджерСтрока);
			
		КонецЦикла;
		
		Если МногоКлиентов Тогда
			ТабДок.Вывести(ОбластьМенеджерИтого);
		КонецЕсли;
		
		ТаблицаKPI = ПолучитьKPIМенеджера(ВыборкаМанагеры.Менеджер,ТаблицаПоказателейМенеджеров,тзВыручка,тзКолеса,ТаблицаОборотовСФильтрами);
		ТекущаяСтрокаKPI = -2;
		КоличествоСтрокKPI = ТаблицаKPI.Количество();
		         				
		Для Каждого строкаВыручка Из строкиВыручка Цикл
			
			ТабДок.Вывести(ОбластьДанныеПропускСтроки);
			
			//Самойлов А.С. Начало 2018-01-09 #373
			ВывестиДанныеKPI(ТабДок,ТаблицаKPI,ТекущаяСтрокаKPI,КоличествоСтрокKPI,ОбластьДанныеKPIЗаголовок,ОбластьДанныеKPIСтрока,ОбластьДанныеKPIИтого);
			//Самойлов А.С. Конец  2018-01-09
			
			ОбластьДанныеЗаголовок.Параметры.Клиент = строкаВыручка.Клиент;			
			ТабДок.Вывести(ОбластьДанныеЗаголовок);
			
			//Самойлов А.С. Начало 2018-01-09 #373
			ВывестиДанныеKPI(ТабДок,ТаблицаKPI,ТекущаяСтрокаKPI,КоличествоСтрокKPI,ОбластьДанныеKPIЗаголовок,ОбластьДанныеKPIСтрока,ОбластьДанныеKPIИтого);
			//Самойлов А.С. Конец  2018-01-09
			
			строкиКолеса = тзКолеса.НайтиСтроки(Новый Структура("Менеджер,Клиент",ВыборкаМанагеры.Менеджер,строкаВыручка.Клиент));
			
			ИтогоБонус = 0;
			
			Для Каждого строкаКолеса Из строкиКолеса Цикл
				
				ОбластьДанныеСтрока.Параметры.Бренд = строкаКолеса.Бренд;
				ОбластьДанныеСтрока.Параметры.Количество = строкаКолеса.КоличествоОборот;
				
				строкаЦена = Неопределено;
				Если ТипЗнч(строкаКолеса.Бренд) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
					строкаЦена = ТаблицаЦенБрендов.Найти(строкаКолеса.Бренд,"Бренд");
				ИначеЕсли ТипЗнч(строкаКолеса.Бренд) = Тип("Строка") Тогда
					строкаЦена = ТаблицаЦенБрендов.Найти(Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка(),"Бренд");
				КонецЕсли;
				
				ЦенаКолеса = 0;
				Если строкаЦена <> Неопределено Тогда
					
					Если строкаВыручка.Клиент = "СВОИ" Тогда
						ЦенаКолеса = строкаЦена.ЦенаСвои;
					Иначе
						ЦенаКолеса = строкаЦена.ЦенаНеСвои;
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьДанныеСтрока.Параметры.Цена = ЦенаКолеса;
				ОбластьДанныеСтрока.Параметры.Бонус = ЦенаКолеса * строкаКолеса.КоличествоОборот;
				
				ИтогоБонус = ИтогоБонус + ОбластьДанныеСтрока.Параметры.Бонус;
				
				ТабДок.Вывести(ОбластьДанныеСтрока);
				
				//Самойлов А.С. Начало 2018-01-09 #373
				ВывестиДанныеKPI(ТабДок,ТаблицаKPI,ТекущаяСтрокаKPI,КоличествоСтрокKPI,ОбластьДанныеKPIЗаголовок,ОбластьДанныеKPIСтрока,ОбластьДанныеKPIИтого);
				//Самойлов А.С. Конец  2018-01-09
				
			КонецЦикла;
			
			ОбластьДанныеИтого.Параметры.Количество = строкаВыручка.КоличествоОборот;
			ОбластьДанныеИтого.Параметры.Бонус = ИтогоБонус;
			ТабДок.Вывести(ОбластьДанныеИтого);
			
			//Самойлов А.С. Начало 2018-01-09 #373
			ВывестиДанныеKPI(ТабДок,ТаблицаKPI,ТекущаяСтрокаKPI,КоличествоСтрокKPI,ОбластьДанныеKPIЗаголовок,ОбластьДанныеKPIСтрока,ОбластьДанныеKPIИтого);
			//Самойлов А.С. Конец  2018-01-09
					
		КонецЦикла;
		
		//Самойлов А.С. Начало 2018-01-09 #373
		Пока ТекущаяСтрокаKPI <= КоличествоСтрокKPI И КоличествоСтрокKPI > 0 Цикл			
			ТабДок.Вывести(ОбластьДанныеПропускСтроки);
			ВывестиДанныеKPI(ТабДок,ТаблицаKPI,ТекущаяСтрокаKPI,КоличествоСтрокKPI,ОбластьДанныеKPIЗаголовок,ОбластьДанныеKPIСтрока,ОбластьДанныеKPIИтого);			
		КонецЦикла;
		//Самойлов А.С. Конец  2018-01-09
		
		
	КонецЦикла;
	
	ТабличныйДокумент = ТабДок;
	
КонецФункции

&НаСервере
Процедура ВывестиДанныеKPI(ТабДок,ТаблицаKPI,ТекущаяСтрокаKPI,КоличествоСтрокKPI,ОбластьДанныеKPIЗаголовок,ОбластьДанныеKPIСтрока,ОбластьДанныеKPIИтого)
	
	//Самойлов А.С. Начало 2018-01-09 #373
	Если КоличествоСтрокKPI > 0 Тогда
		Если ТекущаяСтрокаKPI = -2 Тогда
			ТекущаяСтрокаKPI = -1;
		ИначеЕсли ТекущаяСтрокаKPI = -1 Тогда
			ТабДок.Присоединить(ОбластьДанныеKPIЗаголовок);
			ТекущаяСтрокаKPI = 0;
		ИначеЕсли ТекущаяСтрокаKPI < КоличествоСтрокKPI Тогда
				
			ОбластьДанныеKPIСтрока.Параметры.Заполнить(ТаблицаKPI[ТекущаяСтрокаKPI]);
			ТабДок.Присоединить(ОбластьДанныеKPIСтрока);
			ТекущаяСтрокаKPI = ТекущаяСтрокаKPI + 1;
			
		ИначеЕсли ТекущаяСтрокаKPI = КоличествоСтрокKPI Тогда
			
			ОбластьДанныеKPIИтого.Параметры.Вес = ТаблицаKPI.Итог("Вес");
			ОбластьДанныеKPIИтого.Параметры.СУчетомВеса = ТаблицаKPI.Итог("СУчетомВеса");
			ОбластьДанныеKPIИтого.Параметры.СУчетомВесаВРублях = ТаблицаKPI.Итог("СУчетомВесаВРублях");
			ТабДок.Присоединить(ОбластьДанныеKPIИтого);	
			
			ТекущаяСтрокаKPI = ТекущаяСтрокаKPI + 1;
			
		КонецЕсли;
	КонецЕсли;
	//Самойлов А.С. Конец  2018-01-09	
	
КонецПроцедуры

