
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаИзНастроек = ХранилищеОбщихНастроек.Загрузить("МотивацияГО","ЦеныКолес",,"МотивацияГО");
	
	Если ТаблицаИзНастроек <> Неопределено Тогда
		
		ТаблицаЦен.Загрузить(ТаблицаИзНастроек);
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("МотивацияГО","ЦеныКолес",ТаблицаЦен.Выгрузить(),,"МотивацияГО");			
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры


