Функция СведенияОВнешнейОбработке() Экспорт

	СведенияОбОбработке = Новый Структура;
	//	1. Вид - вид обработки.
	//	Тип данных - строка, допустимо одно из 6 значений.
	//	Значения.
	//	1) Глобальные - "ДополнительнаяОбработка", "ДополнительныйОтчет"
	//	2) Назначаемые - "ЗаполнениеОбъекта", "Отчет", "ПечатнаяФорма" или "СозданиеСвязанныхОбъектов".
	СведенияОбОбработке.Вставить("Вид", "ДополнительнаяОбработка");

	//	2. Назначение - объект, для которого назначается данная обработка, 
	//	Массив строк имен объектов метаданных.
	//	Примеры значений массива - "Документ.АвансовыйОтчет" или "Справочник.*", где * - означает все объекта данного вида.
	//	Для глобальных (не назначаемых) обработок параметр не имеет смысла.
	//ОбъектыМетаданных = Новый Массив;
	//ОбъектыМетаданных.Добавить("Документ.ПересчетТоваров");
	//СведенияОбОбработке.Вставить("Назначение", ОбъектыМетаданных);
	
	//	3. Наименование - название обработки, произвольное наименование
	//	Тип данных - произвольная строка.
	//	Данное наименование будет отображаться в списке дополнительных обработок.
	СведенияОбОбработке.Вставить("Наименование ", "Мотивация ГО: Цены колес по брендам");
	
	//	4. Версия - номер версии обработки
	//	Тип данных - строка в формате "ХХ.ХХ".
	//	Обозначает версию данной обработки, данная версия будет отображаться в списке дополнительных отчетов и обработок.
	СведенияОбОбработке.Вставить("Версия ", "2017.12.17");
	
	//	5. БезопасныйРежим - режим контроля прав пользователя.
	//	Тип данных - булево.
	СведенияОбОбработке.Вставить("БезопасныйРежим", Ложь);
	
	//	6. Информация - краткое описание обработки.
	//	Тип данных - строка.
	//	Данное описание будет отображаться в списке дополнительных обработок.
	СведенияОбОбработке.Вставить("Информация", "Мотивация ГО: Цены колес по брендам. Задача #282");
	
	//	7. Команды - действия предоставляемые обработкой.
	//	Тип данных - таблица значений.
	//	Таблица содержит 5 колонок:
	//	1) Представление. Наименование команды в пользовательском интерфейсе;
	//	2) Идентификатор. Для печатных форм список макетов, для остальных обработок любая строка, уникальная для данной обработки.
	//	3) Использование. Строка, одно из значений - 
	//		- ОткрытиеФормы. Открывает форму обработки.
	//		- ВызовКлиентскогоМетода. Вызов клиентского экспортного метода модуля формы
	//		- ВызовСерверногоМетода. Вызов экспортного серверного метода модуля объекта.
	//		Для внешних печатных форм нужно указывать последнее значение.
	//	4) ПоказыватьОповещение. Булево, нужно ли показывать оповещение при начале и окончании действия.
	//	5) Модификатор. Для внешних печатных форм должно содержаться значение "ПечатьMXL".
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Мотивация ГО: Цены колес по брендам", "ЦеныКолесПоБрендам", "ОткрытиеФормы", Истина, );
	СведенияОбОбработке.Вставить("Команды", ТаблицаКоманд);
	
	Возврат СведенияОбОбработке;
	
КонецФункции // СведенияОВнешнейОбработке()

Функция ПолучитьТаблицуКоманд()

	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

	Возврат ТаблицаКоманд;

КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
  
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды) Экспорт
	


КонецПроцедуры
