
&НаСервере
Процедура РасшС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец = &ГруппаДляРасчетаМотивации";
	
	Запрос.УстановитьПараметр("ГруппаДляРасчетаМотивации",
			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Группа для расчета мотивации (Группы номенклатуры)"));
			
	тзГруппы = Запрос.Выполнить().Выгрузить();
	
	Элементы.ГруппаДляРасчетаМотивации.СписокВыбора.ЗагрузитьЗначения(тзГруппы.ВыгрузитьКолонку("Ссылка"));
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		мзДополнительныеСведения = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		мзДополнительныеСведения.Объект = Объект.Ссылка;
		мзДополнительныеСведения.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Группа для расчета мотивации (Группы номенклатуры)");
		мзДополнительныеСведения.Прочитать();
		
		Если ЗначениеЗаполнено(мзДополнительныеСведения.Значение) Тогда
			ГруппаДляРасчетаМотивации = мзДополнительныеСведения.Значение;
		КонецЕсли;
	КонецЕсли;		
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьЗначениеГруппыДляМотивации(ГруппаНоменклатуры,ГруппаДляМотивации)
	
	мзДополнительныеСведения = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	мзДополнительныеСведения.Объект = ГруппаНоменклатуры;
	мзДополнительныеСведения.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Группа для расчета мотивации (Группы номенклатуры)");
	мзДополнительныеСведения.Значение = ГруппаДляМотивации;
	
	мзДополнительныеСведения.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшС_ПослеЗаписиПосле(ПараметрыЗаписи)
	ЗаписатьЗначениеГруппыДляМотивации(Объект.Ссылка,ГруппаДляРасчетаМотивации);
КонецПроцедуры
