
&Вместо("ПроверитьНаличиеИУдалитьСостояниеДокумента")
Процедура ЭксклюзивAPI_ПроверитьНаличиеИУдалитьСостояниеДокумента(СсылкаНаОбъект)
	//Глушим, чтобы статус не слетал
	
	//ПродолжитьВызов(СсылкаНаОбъект);
	
	//Притула Р.В. Начало 13.08.2018 #2678
	//будем помечать в комментарии состояние пометки удаления и проведения на момент записи
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЭтоСправочник = Истина;
	Иначе
		ЭтоСправочник = Ложь;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.СостоянияЭД.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СсылкаНаОбъект = СсылкаНаОбъект;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если ЭтоСправочник Тогда
			Если СсылкаНаОбъект.ПометкаУдаления = МенеджерЗаписи.Комментарий <> "ПометкаУдаления = Истина" Тогда
				МенеджерЗаписи.Комментарий = ?(СсылкаНаОбъект.ПометкаУдаления,"ПометкаУдаления = Истина","");
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			КонецЕсли;	
		Иначе	
			Если СсылкаНаОбъект.ПометкаУдаления И Не МенеджерЗаписи.Комментарий = "ПометкаУдаления = Истина" Тогда
				МенеджерЗаписи.Комментарий = "ПометкаУдаления = Истина";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			ИначеЕсли СсылкаНаОбъект.Проведен И (МенеджерЗаписи.Комментарий = "ПометкаУдаления = Истина" ИЛИ МенеджерЗаписи.Комментарий = "Проведен = Ложь") Тогда
				МенеджерЗаписи.Комментарий = "";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			ИначеЕсли Не СсылкаНаОбъект.Проведен И МенеджерЗаписи.Комментарий <> "Проведен = Ложь" Тогда
				МенеджерЗаписи.Комментарий = "Проведен = Ложь";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;
				МенеджерЗаписи.Записать();
			ИначеЕсли МенеджерЗаписи.Комментарий <> "" Тогда
				МенеджерЗаписи.Комментарий = "";
				МенеджерЗаписи.СостояниеВерсииЭД = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент;			
				МенеджерЗаписи.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);	
	//Притула Р.В. Конец  13.08.2018
	
КонецПроцедуры
