
//Самойлов А.С. Начало 2018-09-05 #2918
&После("ОбработкаПроведения")
Процедура ЭксклюзивAPI_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросПродажиТойо = Новый Запрос;
	ЗапросПродажиТойо.Текст = 
	"ВЫБРАТЬ
	|    ТоварыОрганизаций.Регистратор КАК Регистратор,
	|    ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|    ТоварыОрганизаций.ВидЗапасов КАК ВидЗапасов,
	|    ТоварыОрганизаций.НомерГТД КАК НомерГТД,
	|    ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|    ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|    ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Склад КАК Склад,
	|    ТоварыОрганизаций.Количество КАК Количество
	|ИЗ
	|    РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|    ТоварыОрганизаций.ВидЗапасов.Контрагент = &КонтрагентТойоКомиссия
	|    И ТоварыОрганизаций.Регистратор = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|    РезервыТоваровОрганизаций.Регистратор,
	|    РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|    РезервыТоваровОрганизаций.ВидЗапасов,
	|    РезервыТоваровОрганизаций.НомерГТД,
	|    РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура,
	|    РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры.Характеристика,
	|    РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры.Склад,
	|    РезервыТоваровОрганизаций.Количество
	|ИЗ
	|    РегистрНакопления.РезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|ГДЕ
	|    РезервыТоваровОрганизаций.ВидЗапасов.Контрагент = &КонтрагентТойоКомиссия
	|    И РезервыТоваровОрганизаций.Регистратор = &Документ";	
	
	ЗапросПродажиТойо.УстановитьПараметр("КонтрагентТойоКомиссия",Справочники.Контрагенты.НайтиПоНаименованию("ТОЙО-Комиссия",Истина));
	ЗапросПродажиТойо.УстановитьПараметр("Документ",Ссылка);
	
	Выборка = ЗапросПродажиТойо.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Отказ Тогда			
			Сообщить("Невозможно проведение данного документа, так как в нём присутствуют товары с ответственного хранения Тойо:");
			Отказ = Истина;
		КонецЕсли;
		
		Сообщить(Строка(Выборка.Номенклатура) + " в количестве " + Строка(Выборка.Количество));
		
	КонецЦикла;
	
КонецПроцедуры
